app/controllers/movies_controller.rb

  def show
  	begin
  		@movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    begin
      @movie = Movie.new(movie_params)
      @movie.save
---
INSERT INTO "movies" ("title", "year", "director", "plot", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    begin
      movie = Movie.find(params[:id])
      movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "year" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["year", 2015], ["updated_at", "2019-02-22 03:42:49.612180"], ["id", 1]]

  def destroy
    begin
      @movie = Movie.destroy(params[:id])
---
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 6]]